Revit 2027 API
RoofComponents.GetPlaneDirections Method
 The plane directions of roof slabs.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<XYZ> GetPlaneDirections()
Public Function GetPlaneDirections As IList(Of XYZ)
public:
IList<XYZ^>^ GetPlaneDirections()
member GetPlaneDirections : unit -> IList<XYZ>
Return Value
IList<XYZ>
 The directions.
See Also
Reference
RoofComponents Class
Autodesk.Revit.DB.IFC Namespace